#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.bastion: Refreshing state... [id=161a6b5e631c819356fdc2c450325e1b82ac853c]
aws_key_pair.bastion_key_pair: Refreshing state... [id=bastion-key-test]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/cb-cluster/cb-service]
aws_ssm_parameter.bastion_key_pair: Refreshing state... [id=/test/bastion/ssh-key]
aws_cloudwatch_log_group.cb_log_group: Refreshing state... [id=/ecs/cb-app]
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
aws_cloudwatch_log_stream.cb_log_stream: Refreshing state... [id=cb-log-stream]
aws_lb_target_group.blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/df48b673d32f1671]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_ecs_task_definition.app: Refreshing state... [id=cb-app-task]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
data.aws_availability_zones.available: Reading...
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster]
data.aws_secretsmanager_secret.github_token: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole-20240816090310994000000001]
data.aws_secretsmanager_secret.github_token: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-01c3cdcddfa347799]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/main/ea7fde6e48daa652]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/main/ea7fde6e48daa652/f4d1d61581524194]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.bff_service_log_group will be created
  + resource "aws_cloudwatch_log_group" "bff_service_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/bff-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "cb-log-group"
        }
      + tags_all          = {
          + "Name" = "cb-log-group"
        }
    }

  # aws_cloudwatch_log_group.cb_log_group will be destroyed
  # (because aws_cloudwatch_log_group.cb_log_group is not in configuration)
  - resource "aws_cloudwatch_log_group" "cb_log_group" {
      - arn               = "arn:aws:logs:eu-west-1:802288441694:log-group:/ecs/cb-app" -> null
      - id                = "/ecs/cb-app" -> null
      - name              = "/ecs/cb-app" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Name" = "cb-log-group"
        } -> null
      - tags_all          = {
          - "Name" = "cb-log-group"
        } -> null
    }

  # aws_cloudwatch_log_stream.bff_service_log_stream will be created
  + resource "aws_cloudwatch_log_stream" "bff_service_log_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/ecs/bff-service"
      + name           = "bff-service-log-stream"
    }

  # aws_cloudwatch_log_stream.cb_log_stream will be destroyed
  # (because aws_cloudwatch_log_stream.cb_log_stream is not in configuration)
  - resource "aws_cloudwatch_log_stream" "cb_log_stream" {
      - arn            = "arn:aws:logs:eu-west-1:802288441694:log-group:/ecs/cb-app:log-stream:cb-log-stream" -> null
      - id             = "cb-log-stream" -> null
      - log_group_name = "/ecs/cb-app" -> null
      - name           = "cb-log-stream" -> null
    }

  # aws_ecs_cluster.main must be replaced
-/+ resource "aws_ecs_cluster" "main" {
      ~ arn                = "arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster" -> (known after apply)
      ~ capacity_providers = [] -> (known after apply)
      ~ id                 = "arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster" -> (known after apply)
      ~ name               = "cb-cluster" -> "asics-cluster" # forces replacement
      - tags               = {} -> null
      ~ tags_all           = {} -> (known after apply)

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # aws_ecs_service.bff_service will be created
  + resource "aws_ecs_service" "bff_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bff-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bff_service"
          + container_port   = 8081
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-01c3cdcddfa347799",
            ]
          + subnets          = [
              + "subnet-036a5e724b44fa8df",
              + "subnet-0a15b82f75b3300cd",
            ]
        }
    }

  # aws_ecs_service.main will be destroyed
  # (because aws_ecs_service.main is not in configuration)
  - resource "aws_ecs_service" "main" {
      - cluster                            = "arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 0 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:eu-west-1:802288441694:service/cb-cluster/cb-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "cb-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:eu-west-1:802288441694:task-definition/cb-app-task:9" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "cb-app" -> null
          - container_port   = 8081 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/df48b673d32f1671" -> null
        }

      - network_configuration {
          - assign_public_ip = true -> null
          - security_groups  = [
              - "sg-01c3cdcddfa347799",
            ] -> null
          - subnets          = [
              - "subnet-036a5e724b44fa8df",
              - "subnet-0a15b82f75b3300cd",
            ] -> null
        }
    }

  # aws_ecs_task_definition.app will be destroyed
  # (because aws_ecs_task_definition.app is not in configuration)
  - resource "aws_ecs_task_definition" "app" {
      - arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/cb-app-task:6" -> null
      - arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/cb-app-task" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = []
                  - essential        = true
                  - image            = "nginx:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/cb-app"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 1024
                  - mountPoints      = []
                  - name             = "cb-app"
                  - portMappings     = [
                      - {
                          - containerPort = 8081
                          - hostPort      = 8081
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "512" -> null
      - execution_role_arn       = "arn:aws:iam::802288441694:role/ecs-execution-role" -> null
      - family                   = "cb-app-task" -> null
      - id                       = "cb-app-task" -> null
      - memory                   = "1024" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 6 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }

  # aws_ecs_task_definition.bff_service_app will be created
  + resource "aws_ecs_task_definition" "bff_service_app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 512
                  + environment      = [
                      + {
                          + name  = "CACHE_CONFIG_TTL"
                          + value = "60"
                        },
                      + {
                          + name  = "CLUTCH_BASE_URL"
                          + value = "https://id-sandbox.asics.com"
                        },
                      + {
                          + name  = "CLUTCH_BULKHEAD_MAX_CONCURRENT_CALLS"
                          + value = "100"
                        },
                      + {
                          + name  = "CLUTCH_CIRCUIT_BREAKER_FAILURE_RATE_THRESHOLD"
                          + value = "50"
                        },
                      + {
                          + name  = "CLUTCH_CIRCUIT_BREAKER_PERMITTED_NUMBER_OF_CALLS_IN_HALF_OPEN_STATE"
                          + value = "5"
                        },
                      + {
                          + name  = "CLUTCH_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_CLOSED_STATE"
                          + value = "100"
                        },
                      + {
                          + name  = "CLUTCH_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_HALF_OPEN_STATE"
                          + value = "10"
                        },
                      + {
                          + name  = "CLUTCH_CIRCUIT_BREAKER_WAIT_DURATION_IN_OPEN_STATE"
                          + value = "30s"
                        },
                      + {
                          + name  = "CLUTCH_RATE_LIMITER_CAPACITY"
                          + value = "2"
                        },
                      + {
                          + name  = "CLUTCH_RATE_LIMITER_PERIOD"
                          + value = "60"
                        },
                      + {
                          + name  = "CLUTCH_RATE_LIMITER_TOKENS"
                          + value = "10"
                        },
                      + {
                          + name  = "CLUTCH_RETRY_MAX_ATTEMPTS"
                          + value = "3"
                        },
                      + {
                          + name  = "CLUTCH_RETRY_WAIT_DURATION"
                          + value = "500ms"
                        },
                      + {
                          + name  = "CLUTCH_TIME_LIMITER_TIMEOUT_DURATION"
                          + value = "2s"
                        },
                    ]
                  + image            = "802288441694.dkr.ecr.eu-west-1.amazonaws.com/asics-bff:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/bff-service"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 1024
                  + name             = "bff-service"
                  + portMappings     = [
                      + {
                          + containerPort = 8081
                          + hostPort      = 8081
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::802288441694:role/ecs-execution-role"
      + family                   = "bff-service-app-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # aws_iam_role.ecs_auto_scale_role must be replaced
-/+ resource "aws_iam_role" "ecs_auto_scale_role" {
      ~ arn                   = "arn:aws:iam::802288441694:role/myEcsAutoScaleRole" -> (known after apply)
      ~ create_date           = "2024-08-16T09:03:10Z" -> (known after apply)
      ~ id                    = "myEcsAutoScaleRole" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole",
        ] -> (known after apply)
      ~ name                  = "myEcsAutoScaleRole" -> "EcsAutoScaleRole" # forces replacement
      + name_prefix           = (known after apply)
      ~ role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA3VTA6DFPBWI3CSJLH" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.ecs_auto_scale_role must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_auto_scale_role" {
      ~ id         = "myEcsAutoScaleRole-20240816090310994000000001" -> (known after apply)
      ~ role       = "myEcsAutoScaleRole" -> "EcsAutoScaleRole" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_key_pair.bastion_key_pair will be destroyed
  # (because aws_key_pair.bastion_key_pair is not in configuration)
  - resource "aws_key_pair" "bastion_key_pair" {
      - arn         = "arn:aws:ec2:eu-west-1:802288441694:key-pair/bastion-key-test" -> null
      - fingerprint = "66:02:13:8a:62:99:a9:4b:63:ed:8c:f1:6a:04:86:2d" -> null
      - id          = "bastion-key-test" -> null
      - key_name    = "bastion-key-test" -> null
      - key_pair_id = "key-032cf5b7307cc85ba" -> null
      - key_type    = "rsa" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDjBuiFTtj30W584YBKfcO0H3Ii1vug9MIzrlXFnGB+UECVNJD2WBSoIYBNs3OcBZlnNutUC5vYFwPXlyl8j9fezYPwOcZIL7QlSN81wLGT/41YEUxGdOadmoHdpa1VdTbPS5d0zch3WVeK9mTU/kb/eDOAYgZOkxgiohGBKWhJ7+jLfkHm/Z8+vXHPUJRcrmvHVo5DxQgzxSPDkO7dlNar3hpEI/NsykHRs9GK5HMOK++1fommHGqAvbXm2iuNdPuLW1hop0imNoEauPGFPa2lPhw97RoTJpZiDqTJPwtRQ6/In0AM+LNPY/oXARGi9SOi5aEweLGrWeBLN/eIapuj" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_lb_listener.dev_listener will be updated in-place
  ~ resource "aws_lb_listener" "dev_listener" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/main/ea7fde6e48daa652/f4d1d61581524194"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/df48b673d32f1671" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.bff_service_blue_tg will be created
  + resource "aws_lb_target_group" "bff_service_blue_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "bff-service-blue-target-group"
      + port                               = 8081
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-034dd95974f394745"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group.blue_tg will be destroyed
  # (because aws_lb_target_group.blue_tg is not in configuration)
  - resource "aws_lb_target_group" "blue_tg" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/df48b673d32f1671" -> null
      - arn_suffix                         = "targetgroup/blue-target-group/df48b673d32f1671" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/df48b673d32f1671" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "blue-target-group" -> null
      - port                               = 8081 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-034dd95974f394745" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 3 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
        id                     = "sg-01c3cdcddfa347799"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 8081
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05b6da332a709d6c8",
                ]
              - self             = false
              - to_port          = 8081
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-05b6da332a709d6c8",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.bastion_key_pair will be destroyed
  # (because aws_ssm_parameter.bastion_key_pair is not in configuration)
  - resource "aws_ssm_parameter" "bastion_key_pair" {
      - arn       = "arn:aws:ssm:eu-west-1:802288441694:parameter/test/bastion/ssh-key" -> null
      - data_type = "text" -> null
      - id        = "/test/bastion/ssh-key" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "/test/bastion/ssh-key" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # tls_private_key.bastion will be destroyed
  # (because tls_private_key.bastion is not in configuration)
  - resource "tls_private_key" "bastion" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "161a6b5e631c819356fdc2c450325e1b82ac853c" -> null
      - private_key_openssh           = (sensitive value) -> null
      - private_key_pem               = (sensitive value) -> null
      - private_key_pem_pkcs8         = (sensitive value) -> null
      - public_key_fingerprint_md5    = "1e:48:8c:c6:ef:77:b6:9e:d0:eb:96:c8:26:86:2d:52" -> null
      - public_key_fingerprint_sha256 = "SHA256:ZrZeDBTBCJhI/OwPwYBbC1B1FL7T70vD3SMBp/9uuC8" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDjBuiFTtj30W584YBKfcO0H3Ii1vug9MIzrlXFnGB+UECVNJD2WBSoIYBNs3OcBZlnNutUC5vYFwPXlyl8j9fezYPwOcZIL7QlSN81wLGT/41YEUxGdOadmoHdpa1VdTbPS5d0zch3WVeK9mTU/kb/eDOAYgZOkxgiohGBKWhJ7+jLfkHm/Z8+vXHPUJRcrmvHVo5DxQgzxSPDkO7dlNar3hpEI/NsykHRs9GK5HMOK++1fommHGqAvbXm2iuNdPuLW1hop0imNoEauPGFPa2lPhw97RoTJpZiDqTJPwtRQ6/In0AM+LNPY/oXARGi9SOi5aEweLGrWeBLN/eIapuj
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA4wbohU7Y99FufOGASn3D
            tB9yItb7oPTCM65VxZxgflBAlTSQ9lgUqCGATbNznAWZZzbrVAub2BcD15cpfI/X
            3s2D8DnGSC+0JUjfNcCxk/+NWBFMRnTmnZqB3aWtVXU2z0uXdM3Id1lXivZk1P5G
            /3gzgGIGTpMYIqIRgSloSe/oy35B5v2fPr1xz1CUXK5rx1aOQ8UIM8Ujw5Du3ZTW
            q94aRCPzbMpB0bPRiuRzDivvtX6JphxqgL215torjXT7i1tYaKdIpjaBGrjxhT2t
            pT4cPe0aEyaWYg6kyT8LUUOvyJ9ADPizT2P6FwERovUjouWhMHixq1ngSzf3iGqb
            owIDAQAB
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 2048 -> null
    }

Plan: 8 to add, 2 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*